# FabricationSpotTopElevationOfPart Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ParameterTypeId..::..FabricationSpotTopElevationOfPart Property
ParameterTypeId Class See Also
---
"Spot Top Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationSpotTopElevationOfPart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationSpotTopElevationOfPart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationSpotTopElevationOfPart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace